# ExpandTreeControlItem

## Description
Expands or collapses the specified tree control item.

```pascal
PROCEDURE ExpandTreeControlItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				nItemID      : INTEGER;
				bExpand      : BOOLEAN);
```

```python
def vs.ExpandTreeControlItem(nDialogID, nComponentID, nItemID, bExpand):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|nItemID|INTEGER|   |
|bExpand|BOOLEAN|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern